Update: organize files, push latest readme, add final report
